gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527z(m-s)xx-pinctrl.h
/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)

/* I2C2_TXFRAME */
#define I2C2_TXFRAME_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PF14 \
	GD32_PINMUX_AF('F', 14, AF4)
#define I2C3_SCL_PG1 \
	GD32_PINMUX_AF('G', 1, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define I2C3_SDA_PF15 \
	GD32_PINMUX_AF('F', 15, AF4)
#define I2C3_SDA_PG0 \
	GD32_PINMUX_AF('G', 0, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PF13 \
	GD32_PINMUX_AF('F', 13, AF4)

/* I2C4_SCL */
#define I2C4_SCL_PF1 \
	GD32_PINMUX_AF('F', 1, AF6)
#define I2C4_SCL_PG7 \
	GD32_PINMUX_AF('G', 7, AF6)
#define I2C4_SCL_PG14 \
	GD32_PINMUX_AF('G', 14, AF4)

/* I2C4_SDA */
#define I2C4_SDA_PF0 \
	GD32_PINMUX_AF('F', 0, AF6)
#define I2C4_SDA_PG8 \
	GD32_PINMUX_AF('G', 8, AF6)

/* I2C4_SMBA */
#define I2C4_SMBA_PF2 \
	GD32_PINMUX_AF('F', 2, AF6)
#define I2C4_SMBA_PG6 \
	GD32_PINMUX_AF('G', 6, AF6)

/* I2C5_SCL */
#define I2C5_SCL_PF11 \
	GD32_PINMUX_AF('F', 11, AF4)

/* I2C5_SDA */
#define I2C5_SDA_PF12 \
	GD32_PINMUX_AF('F', 12, AF4)

/* I2C5_SMBA */
#define I2C5_SMBA_PF10 \
	GD32_PINMUX_AF('F', 10, AF4)
#define I2C5_SMBA_PG15 \
	GD32_PINMUX_AF('G', 15, AF4)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define I2S1_ADD_SD_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)

/* I2S1_CK */
#define I2S1_CK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define I2S1_CK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define I2S1_CK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define I2S1_CK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define I2S1_MCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* I2S1_WS */
#define I2S1_WS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define I2S1_WS_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define I2S2_ADD_SD_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* I2S2_MCK */
#define I2S2_MCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF6)

/* I2S2_SD */
#define I2S2_SD_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define I2S2_SD_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2S2_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define I2S2_SD_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)
#define I2S2_SD_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S_CKIN */
#define I2S_CKIN_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define I2S_CKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF5)
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* IREF */
#define IREF_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* JNTRST */
#define JNTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* RTC_REFIN */
#define RTC_REFIN_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* SAI0_FS_0 */
#define SAI0_FS_0_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)
#define SAI0_FS_0_PE4 \
	GD32_PINMUX_AF('E', 4, AF6)

/* SAI0_FS_1 */
#define SAI0_FS_1_PB9 \
	GD32_PINMUX_AF('B', 9, AF6)
#define SAI0_FS_1_PF9 \
	GD32_PINMUX_AF('F', 9, AF6)

/* SAI0_MCLK_0 */
#define SAI0_MCLK_0_PE2 \
	GD32_PINMUX_AF('E', 2, AF6)

/* SAI0_MCLK_1 */
#define SAI0_MCLK_1_PC0 \
	GD32_PINMUX_AF('C', 0, AF6)
#define SAI0_MCLK_1_PF7 \
	GD32_PINMUX_AF('F', 7, AF6)

/* SAI0_SCK_0 */
#define SAI0_SCK_0_PE5 \
	GD32_PINMUX_AF('E', 5, AF6)

/* SAI0_SCK_1 */
#define SAI0_SCK_1_PF8 \
	GD32_PINMUX_AF('F', 8, AF6)

/* SAI0_SD_0 */
#define SAI0_SD_0_PB2 \
	GD32_PINMUX_AF('B', 2, AF6)
#define SAI0_SD_0_PC1 \
	GD32_PINMUX_AF('C', 1, AF6)
#define SAI0_SD_0_PD6 \
	GD32_PINMUX_AF('D', 6, AF6)
#define SAI0_SD_0_PE6 \
	GD32_PINMUX_AF('E', 6, AF6)

/* SAI0_SD_1 */
#define SAI0_SD_1_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)
#define SAI0_SD_1_PE3 \
	GD32_PINMUX_AF('E', 3, AF6)
#define SAI0_SD_1_PF6 \
	GD32_PINMUX_AF('F', 6, AF6)

/* SDIO_CK */
#define SDIO_CK_PB2 \
	GD32_PINMUX_AF('B', 2, AF12)
#define SDIO_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF12)

/* SDIO_CMD */
#define SDIO_CMD_PA6 \
	GD32_PINMUX_AF('A', 6, AF12)
#define SDIO_CMD_PD2 \
	GD32_PINMUX_AF('D', 2, AF12)

/* SDIO_D0 */
#define SDIO_D0_PB4 \
	GD32_PINMUX_AF('B', 4, AF12)
#define SDIO_D0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* SDIO_D1 */
#define SDIO_D1_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)
#define SDIO_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)
#define SDIO_D1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)

/* SDIO_D2 */
#define SDIO_D2_PA9 \
	GD32_PINMUX_AF('A', 9, AF12)
#define SDIO_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)
#define SDIO_D2_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)

/* SDIO_D3 */
#define SDIO_D3_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)

/* SDIO_D4 */
#define SDIO_D4_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)

/* SDIO_D5 */
#define SDIO_D5_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)

/* SDIO_D6 */
#define SDIO_D6_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* SDIO_D7 */
#define SDIO_D7_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)
#define SDIO_D7_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)
#define SPI0_MISO_PE5 \
	GD32_PINMUX_AF('E', 5, AF7)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI0_MOSI_PE0 \
	GD32_PINMUX_AF('E', 0, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI0_NSS_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI0_SCK_PC13 \
	GD32_PINMUX_AF('C', 13, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)
#define SPI1_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define SPI1_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define SPI1_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define SPI1_MOSI_PF14 \
	GD32_PINMUX_AF('F', 14, AF5)

